<a href="https://colab.research.google.com/github/adilnarakkoden1/datasciencelab/blob/main/adilnk3panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
x=[1,23,44,5,6]
csk=pd.Series(x)
print(csk)

0     1
1    23
2    44
3     5
4     6
dtype: int64

In [ ]:
import pandas as pd
x=[1,2,3,4,5,6,11,22,99,100]
csk=pd.Series(x,index=['N','A','R','A','K','K','O','D','E','N'])
print(csk)

N      1
A      2
R      3
A      4
K      5
K      6
O     11
D     22
E     99
N    100
dtype: int64

In [ ]:
import pandas as pd
csk=pd.Series([1,2,3,4,5,6,11,22,99,100] ,index = ['N','A','R','A','K','K','O','D','E','N'])
print (csk[ :8])

N     1
A     2
R     3
A     4
K     5
K     6
O    11
D    22
dtype: int64

In [ ]:
import pandas as pd
csk=pd.Series([1,2,3,4,5,6,11,22,99,100] ,index = ['N','A','R','A','K','K','O','D','E','N'])
print (csk[:-8])

N    1
A    2
dtype: int64

In [ ]:
import pandas as pd
csk=pd.Series([1,2,3,4,5,6,11,22,99,100] ,index = ['N','A','R','A','K','K','O','D','E','N'])
print (csk['A'])

A    2
A    4
dtype: int64

In [ ]:
import pandas as pd
x= {'a':10,'b':20,'c':30}
y= pd.Series(x)
print(x)

{'a': 10, 'b': 20, 'c': 30}

In [ ]:
import pandas as pd
df = pd.read_csv('adilnn.csv')
print(df.to_string())

     name  age        dob
0    amal   28  20/5/1998
1   rahul   78        NaN
2   midun   22        NaN
3   basil   21        NaN
4    anas   44        NaN
5  hashim   56        NaN
6    rauf   55        NaN
7  vajisd   22        NaN

In [ ]:
import pandas as pd
df = pd.read_csv('ad2.csv')
df.tail()

     name  age        dob
3   basil   21  20/5/2001
4    anas   44  20/5/2002
5  hashim   56  20/5/2003
6    rauf   55  20/5/2004
7  vajisd   22  20/5/2005

In [ ]:
import pandas as pd
df = pd.read_csv('ad2.csv')
df.head()

    name  age        dob
0   amal   28  20/5/1998
1  rahul   78  20/5/1999
2  midun   22  20/5/2000
3  basil   21  20/5/2001
4   anas   44  20/5/2002

In [ ]:
import pandas as pd
df = pd.read_csv('ad2.csv')
df.head(5)

    name  age        dob
0   amal   28  20/5/1998
1  rahul   78  20/5/1999
2  midun   22  20/5/2000
3  basil   21  20/5/2001
4   anas   44  20/5/2002

In [ ]:
import pandas as pd
df = pd.read_csv('ad2.csv')
df.tail(2)

     name  age        dob
6    rauf   55  20/5/2004
7  vajisd   22  20/5/2005

In [ ]:
import pandas as pd
df = pd.read_csv('adil4.csv')
df.drop_duplicates("name")

     name  age        dob
0    amal   28  20/5/1998
1   rahul   28  20/5/1999
2   midun   22  20/5/2000
3   basil   21  20/5/2001
4    anas   44  20/5/2002
5  hashim   56  20/5/2003
6    rauf   55  20/5/2004
7  vajisd   22  20/5/2005

In [ ]:
import pandas as pd
df = pd.read_csv('adil5.csv')
df.dropna

<bound method DataFrame.dropna of      name  age        dob
0    amal   28  20/5/1998
1   rahul   28  20/5/1999
2   midun   22  20/5/2000
3   basil   21  20/5/2001
4    anas   44  20/5/2002
5  hashim   56  20/5/2003
6     NaN   55  20/5/2004
7  vajisd   22  20/5/2005
8    amal   32  20/5/2006>

In [ ]:
import pandas as pd
df = pd.read_csv('adil5.csv')
df.corr(method="pearson")

     age
age  1.0